In [165]:
# Ans1
import pandas as pd
course_name=['Data Science', 'Machine Learning', 'Big Data','Data Engineer']
duration=[2,3,6,4]
df=pd.DataFrame(data={'course_name': course_name, 'duration': duration})
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [166]:
df.iloc[[2]]

  course_name  duration
2    Big Data         6

In [167]:
# Ans2
print('''The main distinction between loc and iloc is: loc is label-based, which means that you have to specify rows and columns based on their row and column labels. iloc is integer position-based, so you have to specify rows and columns by their integer position values (0-based integer position).
''')

The main distinction between loc and iloc is: loc is label-based, which means that you have to specify rows and columns based on their row and column labels. iloc is integer position-based, so you have to specify rows and columns by their integer position values (0-based integer position).

In [168]:
# Ans3
course_name=['Data Science', 'Machine Learning', 'Big Data','Data Engineer']
duration=[2,3,6,4]
idx=[3,0,1,2]
new_df=pd.DataFrame(data={'course_name': course_name, 'duration': duration},index=idx)
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [169]:
new_df.loc[[2]]

     course_name  duration
2  Data Engineer         4

In [170]:
new_df.iloc[[2]]

  course_name  duration
1    Big Data         6

In [171]:
print("yes there is a diff in output when i appliend loc & iloc, when i applied loc so it displayed the data accroding to the index given/as instructed in variable, \n while when i applied iloc, it gave output as per the default index number which is not given or inatructed by programmer ")

yes there is a diff in output when i appliend loc & iloc, when i applied loc so it displayed the data accroding to the index given/as instructed in variable,
 while when i applied iloc, it gave output as per the default index number which is not given or inatructed by programmer

In [200]:
# Ans4
import pandas as pd
import numpy as np
columns=['column_1', 'column_2','column_3', 'column_4', 'column_5', 'column_6']
indices=[1,2,3,4,5,6]

df1=pd.DataFrame(np.random.rand(6,6), columns=columns, index=indices)
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.783671  0.769577  0.035965  0.499951  0.274938  0.374739
2  0.331603  0.574473  0.548075  0.389194  0.185783  0.237719
3  0.013613  0.876963  0.342995  0.525738  0.296672  0.766649
4  0.848650  0.211757  0.354288  0.043538  0.752676  0.871217
5  0.085168  0.856597  0.355447  0.510978  0.258204  0.547002
6  0.147984  0.555852  0.003538  0.794346  0.726653  0.176312

In [201]:
df1.mean()

column_1    0.368448
column_2    0.640870
column_3    0.273385
column_4    0.460624
column_5    0.415821
column_6    0.495606
dtype: float64

In [202]:
df1.std()

column_1    0.363076
column_2    0.250846
column_3    0.211076
column_4    0.244440
column_5    0.253729
column_6    0.282932
dtype: float64

In [203]:
df1.iat[1,1]='Arunesh'

In [204]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.783671  0.769577  0.035965  0.499951  0.274938  0.374739
2  0.331603   Arunesh  0.548075  0.389194  0.185783  0.237719
3  0.013613  0.876963  0.342995  0.525738  0.296672  0.766649
4  0.848650  0.211757  0.354288  0.043538  0.752676  0.871217
5  0.085168  0.856597  0.355447  0.510978  0.258204  0.547002
6  0.147984  0.555852  0.003538  0.794346  0.726653  0.176312

In [205]:
df1.dtypes=='object'

column_1    False
column_2     True
column_3    False
column_4    False
column_5    False
column_6    False
dtype: bool

In [206]:
df1['column_2']

1    0.769577
2     Arunesh
3    0.876963
4    0.211757
5    0.856597
6    0.555852
Name: column_2, dtype: object

In [207]:
print('we cant find mean value of this beacuse now it is categorical or string or object')

we cant find mean value of this beacuse now it is categorical or string or object

In [210]:
# Ans6
print("A window function executes a calculation across a related set of table rows to the current row. It is also called SQL analytic function. It uses values from one or different rows to return a value for each row. A distinct feature of a window function is the OVER clause.\n")
print('''pandas supports 4 types of windowing operations:

Rolling window: Generic fixed or variable sliding window over the values.

Weighted window: Weighted, non-rectangular window supplied by the scipy.signal library.

Expanding window: Accumulating window over the values.

Exponentially Weighted window: Accumulating and exponentially weighted window over the values.
''')

A window function executes a calculation across a related set of table rows to the current row. It is also called SQL analytic function. It uses values from one or different rows to return a value for each row. A distinct feature of a window function is the OVER clause.

pandas supports 4 types of windowing operations:

Rolling window: Generic fixed or variable sliding window over the values.

Weighted window: Weighted, non-rectangular window supplied by the scipy.signal library.

Expanding window: Accumulating window over the values.

Exponentially Weighted window: Accumulating and exponentially weighted window over the values.

In [14]:
# Ans7
import pandas as pd
df_date=pd.DataFrame({'date':['04-03-2023']})
df_date['updated_date']=pd.to_datetime(df_date['date'])
df_date['month']=df_date['updated_date'].dt.month
df_date['Year']=df_date['updated_date'].dt.year
df_date

         date updated_date  month  Year
0  04-03-2023   2023-04-03      4  2023

In [24]:
# Ans8

from datetime import date
 
def numOfDays(date1, date2):
    return (date2-date1).days
     
# Driver program
date1 = pd.to_datetime(input('Input date in mm-dd-yyyy format'))
date1
date2 = pd.to_datetime(input('Input date in mm-dd-yyyy format'))
date2
minutes = (date2-date1).total_seconds() / 60
Hours = minutes / 60

print("No of days=",numOfDays(date1, date2),"Days")
print('Difference in Hours: ', int(Hours), 'hours')
print('Total difference in minutes: ', int(minutes),'minutes')

Input date in mm-dd-yyyy format 12-12-2023
Input date in mm-dd-yyyy format 13-12-2023

No of days= 1 Days
Difference in Hours:  24 hours
Total difference in minutes:  1440 minutes

/tmp/ipykernel_329/3052717420.py:11: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  date2 = pd.to_datetime(input('Input date in mm-dd-yyyy format'))

In [23]:
# Ans9
import pandas as pd
import csv 
fields =['Student_Name', 'Student_Category']
rows=[['Aman','Junior'],
     ['Rohit','Junior'],
     ['Raman','Senior'],
     ['Arunesh','Topper'],
     ['Raj','Average'],
     ['Rajesh','Senior'],
     ['Rajnish','Junior'],
     ['Ankur','Average'],
     ['Ratan','Topper'],
     ['Bharat','Senior']
     ]
filename="Categorical_Data.csv"
with open(filename, 'w') as csvfile: 
    
    csvwriter = csv.writer(csvfile) 
        
    
    csvwriter.writerow(fields) 
        
    
    csvwriter.writerows(rows)

In [24]:
df9=pd.read_csv("Categorical_Data.csv")

In [25]:
df9

  Student_Name Student_Category
0         Aman           Junior
1        Rohit           Junior
2        Raman           Senior
3      Arunesh           Topper
4          Raj          Average
5       Rajesh           Senior
6      Rajnish           Junior
7        Ankur          Average
8        Ratan           Topper
9       Bharat           Senior

In [31]:
df9['Code']=pd.factorize(df9.Student_Category)[0]

In [32]:
df9

  Student_Name Student_Category  Code
0         Aman           Junior     0
1        Rohit           Junior     0
2        Raman           Senior     1
3      Arunesh           Topper     2
4          Raj          Average     3
5       Rajesh           Senior     1
6      Rajnish           Junior     0
7        Ankur          Average     3
8        Ratan           Topper     2
9       Bharat           Senior     1

In [39]:
df9.sort_values('Code')

  Student_Name Student_Category  Code
0         Aman           Junior     0
1        Rohit           Junior     0
6      Rajnish           Junior     0
2        Raman           Senior     1
5       Rajesh           Senior     1
9       Bharat           Senior     1
3      Arunesh           Topper     2
8        Ratan           Topper     2
4          Raj          Average     3
7        Ankur          Average     3

In [27]:
# Ans11
import pandas as pd
import csv 
fields =['Student ID', 'Test Score']
rows=[[1,85],
     [2,90],
     [3,80],
     [4,75],
     [5,85],
     [6,82],
     [7,78],
     [8,85],
     [9,90],
     [10,85]
     ]
filename="student_data.csv"
with open(filename, 'w') as csvfile: 
    
    csvwriter = csv.writer(csvfile) 
        
    
    csvwriter.writerow(fields) 
        
    
    csvwriter.writerows(rows)

In [5]:
df1=pd.read_csv("student_data.csv")

In [28]:
df_mean=df1['Test Score'].mean()
df_mean

83.5

In [30]:
df_median=df1['Test Score'].median()
df_median

85.0

In [32]:
df_mode=df1['Test Score'].mode()
df_mode

0    85
Name: Test Score, dtype: int64

In [44]:
pd.DataFrame({'Statistic|Value|':[df_mean, df_median,df_mode]},index=['Man','Median','Mode'])

                              Statistic|Value|
Man                                       83.5
Median                                    85.0
Mode    0    85
Name: Test Score, dtype: int64